----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/monicaelgawly/Downloads/wage2_monica.log
  log type:  text
 opened on:  15 Apr 2018, 00:01:35

. use "/Users/monicaelgawly/Downloads/wage2.dta"

. gen educexper = educ*exper

. reg lwage educ exper educexper, r

Linear regression                               Number of obs     =        935
                                                F(3, 931)         =      50.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1349
                                                Root MSE          =     .39233

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0440498   .0178328     2.47   0.014     .0090527    .0790469
       exper |  -.0214959   .0193845    -1.11   0.268    -.0595383    .0165465
   educexper |    .003203   .0014829     2.16   0.031     .0002928    .0061132
       _cons |   5.949455   .2468364    24.10   0.000     5.465035    6.433875
------------------------------------------------------------------------------

. reg lwage educ exper tenure married black south urban, r

Linear regression                               Number of obs     =        935
                                                F(7, 927)         =      50.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2526
                                                Root MSE          =     .36547

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0654307   .0064093    10.21   0.000     .0528524    .0780091
       exper |    .014043   .0032386     4.34   0.000     .0076872    .0203988
      tenure |   .0117473   .0025387     4.63   0.000      .006765    .0167295
     married |   .1994171   .0396937     5.02   0.000      .121517    .2773171
       black |  -.1883499   .0367035    -5.13   0.000    -.2603816   -.1163182
       south |  -.0909036    .027363    -3.32   0.001    -.1446043    -.037203
       urban |   .1839121   .0271125     6.78   0.000     .1307031     .237121
       _cons |   5.395497   .1131274    47.69   0.000     5.173482    5.617513
------------------------------------------------------------------------------

. tab educ

   years of |
  education |      Freq.     Percent        Cum.
------------+-----------------------------------
          9 |         10        1.07        1.07
         10 |         35        3.74        4.81
         11 |         43        4.60        9.41
         12 |        393       42.03       51.44
         13 |         85        9.09       60.53
         14 |         77        8.24       68.77
         15 |         45        4.81       73.58
         16 |        150       16.04       89.63
         17 |         40        4.28       93.90
         18 |         57        6.10      100.00
------------+-----------------------------------
      Total |        935      100.00

. sum educ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        educ |        935    13.46845    2.196654          9         18

. sum exper

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       exper |        935    11.56364    4.374586          1         23

. sum tenure

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      tenure |        935    7.234225    5.075206          0         22

. sum married

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     married |        935    .8930481    .3092174          0          1

. sum black 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       black |        935    .1283422    .3346495          0          1

. sum south

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       south |        935    .3411765    .4743582          0          1

. sum urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       urban |        935    .7176471    .4503851          0          1

. gen mb = 0

. replace mb = 1 if married == 1 & black == 1
(102 real changes made)

. gen nmb = 0

. replace nmb = 1 if married == 0 & black == 1
(18 real changes made)

. gen mnb = 0

. replace mnb = 1 if married == 1 & black == 0
(733 real changes made)

. gen nmnb = 0

. replace nmnb = 1 if married == 0 & black == 0
(82 real changes made)

. reg lwage educ exper tenure south urban mb nmb nmnb, r

Linear regression                               Number of obs     =        935
                                                F(8, 926)         =      44.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2528
                                                Root MSE          =      .3656

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0654751   .0064153    10.21   0.000     .0528848    .0780654
       exper |   .0141462   .0032479     4.36   0.000     .0077721    .0205203
      tenure |   .0116628   .0025493     4.57   0.000     .0066597     .016666
       south |  -.0919894   .0274988    -3.35   0.001    -.1459566   -.0380222
       urban |   .1843501   .0271884     6.78   0.000      .130992    .2377081
          mb |  -.1794663   .0403216    -4.45   0.000    -.2585986   -.1003339
         nmb |  -.4297347   .0731179    -5.88   0.000    -.5732308   -.2862386
        nmnb |  -.1889147   .0448302    -4.21   0.000    -.2768953   -.1009341
       _cons |   5.592708   .1093308    51.15   0.000     5.378143    5.807273
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/monicaelgawly/Downloads/wage2_monica.log
  log type:  text
 closed on:  19 Apr 2018, 01:32:17
----------------------------------------------------------------------------------
